; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	thermograph0 - mode
	image1 - mode
	Star2 - direction
	GroundStation4 - direction
	Star0 - direction
	GroundStation3 - direction
	GroundStation1 - direction
	Planet5 - direction
	Star6 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
	Planet14 - direction
	Phenomenon15 - direction
	Phenomenon16 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 image1)
	(calibration_target instrument0 Star0)
	(supports instrument1 thermograph0)
	(supports instrument1 image1)
	(calibration_target instrument1 Star0)
	(supports instrument2 thermograph0)
	(supports instrument2 image1)
	(calibration_target instrument2 GroundStation3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon9)
	(supports instrument3 image1)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 GroundStation1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon16)
)
(:goal (and
	(pointing satellite1 Phenomenon13)
	(have_image Planet5 thermograph0)
	(have_image Star6 image1)
	(have_image Phenomenon7 image1)
	(have_image Planet8 thermograph0)
	(have_image Phenomenon9 image1)
	(have_image Planet10 thermograph0)
	(have_image Phenomenon11 image1)
	(have_image Phenomenon12 image1)
	(have_image Phenomenon13 image1)
	(have_image Planet14 image1)
	(have_image Phenomenon15 image1)
	(have_image Phenomenon16 thermograph0)
))

)

; plan
1. (turn_to satellite1 groundstation1 phenomenon16)
   deleted: (pointing satellite1 phenomenon16)
   added: (pointing satellite1 groundstation1)
   goals met: 0 of 13
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 13
3. (calibrate satellite1 instrument3 groundstation1)
   added: (calibrated instrument3)
   goals met: 0 of 13
4. (turn_to satellite1 phenomenon7 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 phenomenon7)
   goals met: 0 of 13
5. (take_image satellite1 phenomenon7 instrument3 image1)
   added: (have_image phenomenon7 image1)
   goals met: 1 of 13
6. (turn_to satellite1 phenomenon16 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 phenomenon16)
   goals met: 1 of 13
7. (take_image satellite1 phenomenon16 instrument3 thermograph0)
   added: (have_image phenomenon16 thermograph0)
   goals met: 2 of 13
8. (turn_to satellite1 phenomenon15 phenomenon16)
   deleted: (pointing satellite1 phenomenon16)
   added: (pointing satellite1 phenomenon15)
   goals met: 2 of 13
9. (take_image satellite1 phenomenon15 instrument3 image1)
   added: (have_image phenomenon15 image1)
   goals met: 3 of 13
10. (turn_to satellite1 phenomenon12 phenomenon15)
   deleted: (pointing satellite1 phenomenon15)
   added: (pointing satellite1 phenomenon12)
   goals met: 3 of 13
11. (take_image satellite1 phenomenon12 instrument3 image1)
   added: (have_image phenomenon12 image1)
   goals met: 4 of 13
12. (turn_to satellite1 phenomenon11 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 phenomenon11)
   goals met: 4 of 13
13. (take_image satellite1 phenomenon11 instrument3 image1)
   added: (have_image phenomenon11 image1)
   goals met: 5 of 13
14. (turn_to satellite1 phenomenon9 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 phenomenon9)
   goals met: 5 of 13
15. (take_image satellite1 phenomenon9 instrument3 image1)
   added: (have_image phenomenon9 image1)
   goals met: 6 of 13
16. (turn_to satellite1 planet10 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 planet10)
   goals met: 6 of 13
17. (take_image satellite1 planet10 instrument3 thermograph0)
   added: (have_image planet10 thermograph0)
   goals met: 7 of 13
18. (turn_to satellite1 planet14 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 planet14)
   goals met: 7 of 13
19. (take_image satellite1 planet14 instrument3 image1)
   added: (have_image planet14 image1)
   goals met: 8 of 13
20. (turn_to satellite1 planet5 planet14)
   deleted: (pointing satellite1 planet14)
   added: (pointing satellite1 planet5)
   goals met: 8 of 13
21. (take_image satellite1 planet5 instrument3 thermograph0)
   added: (have_image planet5 thermograph0)
   goals met: 9 of 13
22. (turn_to satellite1 planet8 planet5)
   deleted: (pointing satellite1 planet5)
   added: (pointing satellite1 planet8)
   goals met: 9 of 13
23. (take_image satellite1 planet8 instrument3 thermograph0)
   added: (have_image planet8 thermograph0)
   goals met: 10 of 13
24. (turn_to satellite1 star6 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 star6)
   goals met: 10 of 13
25. (take_image satellite1 star6 instrument3 image1)
   added: (have_image star6 image1)
   goals met: 11 of 13
26. (turn_to satellite1 phenomenon13 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 phenomenon13)
   goals met: 12 of 13
27. (take_image satellite1 phenomenon13 instrument3 image1)
   added: (have_image phenomenon13 image1)
   goals met: 13 of 13
